<script setup lang="ts">
  import { useHead } from '#imports';
  import Autoplay from 'embla-carousel-autoplay';

  useHead({ title: 'Портфолио Betonika' })
</script>

<template>
  <UiSection>
    <h2 class="text-center text-4xl font-bold">Портфолио</h2>
    <div class="hidden flex-col gap-5 pt-5 sm:flex">
      <div class="flex flex-col gap-4 bg-white rounded-lg">
        <NuxtImg provider="cloudinary" src="object1_hweeme" class=" h-96 object-cover rounded-t-lg" loading="lazy"
          placeholder />
        <p class="text-center font-medium p-4">
          Этот проект — воплощение гармонии между комфортом, стилем и природой.
          Коттедж, расположенный на обширном
          участке с живописным садом, стал мечтой наших клиентов о тихом и уютном месте для отдыха с семьей. Фасад дома
          выполнен в современном стиле с использованием натурального камня и дерева, что придает ему изысканный и
          элегантный вид. Внутри — светлые и просторные помещения, где каждая деталь продумана до мелочей.
          Сад вокруг коттеджа стал настоящим украшением проекта. Мы создали ландшафт, который сочетает в себе
          функциональность и красоту: ухоженные газоны, клумбы с цветами, альпийская горка и зона отдыха с беседкой.
          Здесь каждый найдет место для вдохновения и релаксации. Этот коттедж — не просто дом, а настоящий уголок уюта
          и гармонии с природой.</p>
      </div>
      <div class="flex flex-col gap-4 bg-white rounded-lg">
        <NuxtImg provider="cloudinary" src="object2_h8kbon" class=" h-96 object-cover rounded-t-lg" loading="lazy"
          placeholder />
        <p class="text-center font-medium p-4">
          Воплощение минимализма и изысканности. Квартира, выполненная в светлых
          тонах, стала настоящим оазисом спокойствия и уюта. Основной акцент был сделан на белом цвете, который создает
          ощущение простора и легкости. Мы использовали натуральные материалы, такие как дерево, чтобы добавить тепла и
          уюта.
          В интерьере присутствуют не только функциональные, но и декоративные элементы, которые делают пространство
          уникальным. Золотое зеркало стало центральным акцентом в гостиной, добавляя изысканности и света. Пианино,
          стоящее в углу, стало не только музыкальным инструментом, но и стильным элементом дизайна. Растения,
          размещенные по всей квартире, привносят в помещение свежесть и природную атмосферу.
          Каждая деталь в этой квартире была продумана до мелочей, чтобы создать гармоничное и комфортное пространство
          для жизни. Этот ремонт — пример того, как светлые тона, натуральные материалы и изысканные акценты могут
          создать неповторимый интерьер.</p>
      </div>
      <div class="flex flex-col gap-4 bg-white rounded-lg">
        <NuxtImg provider="cloudinary" src="object3_aopvtn" class=" h-96 object-cover rounded-t-lg" loading="lazy"
          placeholder />
        <p class="text-center font-medium p-4">
          Этот проект стал настоящим воплощением нашей миссии — вернуть зданию его
          первоначальный блеск и историческую ценность. Фасад, который когда-то был украшением улицы, со временем
          потерял свой изысканный вид. Наша команда взялась за задачу восстановить его до первоначального состояния с
          максимальной точностью.
          Мы тщательно изучили исторические архивы, чтобы понять, как выглядел фасад в прошлом. Затем, используя
          современные технологии и материалы, мы привели его в состояние, максимально приближенное к оригиналу. Каждый
          кирпич, каждая деталь декора были восстановлены с любовью и вниманием к деталям.
          Результат — фасад, который снова стал гордостью района. Его изысканный вид и гармония с окружающей
          архитектурой восхищают всех, кто проходит мимо. Этот проект — не просто реставрация, а возвращение к истокам,
          восстановление исторической ценности и красоты.</p>
      </div>
    </div>
    <Carousel class=" block sm:hidden mt-5" :plugins="[Autoplay({ delay: 3000 })]" :opts="{
      align: 'center',
      loop: true
    }">
      <CarouselContent class="ml-4 gap-4">
        <CarouselItem class="flex flex-col gap-1 pl-0 h-fit bg-white rounded-lg">
          <NuxtImg provider="cloudinary" src="object1_hweeme" class=" h-56 object-cover rounded-t-lg" loading="lazy"
            placeholder />
          <p class="text-center font-medium p-2">
            Этот проект — воплощение гармонии между комфортом, стилем и природой.
            Коттедж, расположенный на обширном
            участке с живописным садом, стал мечтой наших клиентов о тихом и уютном месте для отдыха с семьей. Фасад
            дома
            выполнен в современном стиле с использованием натурального камня и дерева, что придает ему изысканный и
            элегантный вид. Внутри — светлые и просторные помещения, где каждая деталь продумана до мелочей.
            Сад вокруг коттеджа стал настоящим украшением проекта. Мы создали ландшафт, который сочетает в себе
            функциональность и красоту: ухоженные газоны, клумбы с цветами, альпийская горка и зона отдыха с беседкой.
            Здесь каждый найдет место для вдохновения и релаксации. Этот коттедж — не просто дом, а настоящий уголок
            уюта
            и гармонии с природой.</p>
        </CarouselItem>
        <CarouselItem class="flex flex-col gap-1 pl-0 h-fit bg-white rounded-lg">
          <NuxtImg provider="cloudinary" src="object2_h8kbon" class=" h-56 object-cover rounded-t-lg" loading="lazy"
            placeholder />
          <p class="text-center font-medium p-2">
            Воплощение минимализма и изысканности. Квартира, выполненная в светлых
            тонах, стала настоящим оазисом спокойствия и уюта. Основной акцент был сделан на белом цвете, который
            создает
            ощущение простора и легкости. Мы использовали натуральные материалы, такие как дерево, чтобы добавить
            тепла и
            уюта.
            В интерьере присутствуют не только функциональные, но и декоративные элементы, которые делают пространство
            уникальным. Золотое зеркало стало центральным акцентом в гостиной, добавляя изысканности и света. Пианино,
            стоящее в углу, стало не только музыкальным инструментом, но и стильным элементом дизайна. Растения,
            размещенные по всей квартире, привносят в помещение свежесть и природную атмосферу.
            Каждая деталь в этой квартире была продумана до мелочей, чтобы создать гармоничное и комфортное
            пространство
            для жизни. Этот ремонт — пример того, как светлые тона, натуральные материалы и изысканные акценты могут
            создать неповторимый интерьер.</p>
        </CarouselItem>
        <CarouselItem class="flex flex-col gap-1 pl-0 h-fit bg-white rounded-lg">
          <NuxtImg provider="cloudinary" src="object3_aopvtn" class=" h-56 object-cover rounded-t-lg" loading="lazy"
            placeholder />
          <p class="text-center font-medium p-2">
            Этот проект стал настоящим воплощением нашей миссии — вернуть зданию его
            первоначальный блеск и историческую ценность. Фасад, который когда-то был украшением улицы, со временем
            потерял свой изысканный вид. Наша команда взялась за задачу восстановить его до первоначального состояния
            с
            максимальной точностью.
            Мы тщательно изучили исторические архивы, чтобы понять, как выглядел фасад в прошлом. Затем, используя
            современные технологии и материалы, мы привели его в состояние, максимально приближенное к оригиналу.
            Каждый
            кирпич, каждая деталь декора были восстановлены с любовью и вниманием к деталям.
            Результат — фасад, который снова стал гордостью района. Его изысканный вид и гармония с окружающей
            архитектурой восхищают всех, кто проходит мимо. Этот проект — не просто реставрация, а возвращение к
            истокам,
            восстановление исторической ценности и красоты.</p>
        </CarouselItem>
      </CarouselContent>
    </Carousel>
  </UiSection>
</template>